dadamachines/ArduinoCore-samd/variants/composer_pro/variant.h
#define PIN_LED           M_PB17      //  better leave this out?
#define LED_BUILTIN       M_PB17

#define PIN_LED_M         M_PB17    
#define LED_BUILTIN_M     M_PB17
#define PIN_LED_S         S_PB17    
#define LED_BUILTIN_S     S_PB17



/*
 * USB
 */
#define PIN_USB_DM          M_PA24    // better levea this out?
#define PIN_USB_DP          M_PA25
#define PIN_USB_HOST_ENABLE (M_PA28)  // hmm, wir haben keinen ENABLE PIN!?  habe M_PA28 als Dummy genommen

#define PIN_USB_DM_M      M_PA24
#define PIN_USB_DP_S      M_PA25

#define PIN_USB_DM_S      S_PA24
#define PIN_USB_DP_S      S_PA25




 /*
 * Wire Interfaces
 */
#define WIRE_INTERFACES_COUNT 1

#define PIN_WIRE_SDA         M_PA04 
#define PIN_WIRE_SCL         M_PA05
#define PERIPH_WIRE          sercom0
#define WIRE_IT_HANDLER      SERCOM0_Handler

static const uint8_t SDA = PIN_WIRE_SDA;
static const uint8_t SCL = PIN_WIRE_SCL;





// SPI Interfaces

#define SPI_INTERFACES_COUNT     1

#define PIN_SPI_CS           M_PA18                   
#define PIN_SPI_MISO         M_PA19                  
#define PIN_SPI_SCK          M_PA17                  
#define PIN_SPI_MOSI         M_PA16                  
#define PERIPH_SPI           sercom1

#define PAD_SPI_TX           SPI_PAD_0_SCK_1     // not sure if correct
#define PAD_SPI_RX           SERCOM_RX_PAD_3        // not sure if correct

static const uint8_t SS   = M_PA18 ;                  // not sure if correct
static const uint8_t MOSI = PIN_SPI_MOSI ;
static const uint8_t MISO = PIN_SPI_MISO ;
static const uint8_t SCK  = PIN_SPI_SCK ;



/*
// Serial interfaces


// Serial1
#define PIN_SERIAL1_RX       (0ul)
#define PIN_SERIAL1_TX       (1ul)
#define PAD_SERIAL1_RX       (SERCOM_RX_PAD_1)
#define PAD_SERIAL1_TX       (UART_TX_PAD_0)

 */






// Analog pins

#define PIN_A0               (S_PA10)
#define PIN_A1               (S_PA07)
#define PIN_A2               (S_PA06)
#define PIN_A3               (S_PB08)
//#define PIN_A4               (PIN_A0 + 4)
//#define PIN_A5               (PIN_A0 + 5)
//#define PIN_A6               (PIN_A0 + 6)
//#define PIN_A7               (PIN_A0 + 7)
//#define PIN_A8               (PIN_A0 + 8)
//#define PIN_A9               (PIN_A0 + 9)
//#define PIN_A10              (PIN_A0 + 10)
    
//#define PIN_DAC0             34
//#define PIN_DAC1             35


static const uint8_t A0  = PIN_A0;
static const uint8_t A1  = PIN_A1;
static const uint8_t A2  = PIN_A2;
static const uint8_t A3  = PIN_A3;
//static const uint8_t A4  = PIN_A4;
//static const uint8_t A5  = PIN_A5;
//static const uint8_t A6  = PIN_A6 ;
//static const uint8_t A7  = PIN_A7 ;
//static const uint8_t A8  = PIN_A8 ;
//static const uint8_t A9  = PIN_A9 ;
//static const uint8_t A10 = PIN_A10 ;

//static const uint8_t DAC0 = PIN_DAC0;
//static const uint8_t DAC1 = PIN_DAC1;

#define ADC_RESOLUTION		12

/*
// Other pins
#define PIN_ATN              (26ul)
static const uint8_t ATN = PIN_ATN;
 /*





/*
 * I2S Interfaces
 */
//#define I2S_INTERFACES_COUNT 0
//#define I2S_DEVICE          0
//// no I2S on G19!
//
//
//void dacInit();
//void dacWrite(uint16_t  left ,uint16_t  right);
    



#ifdef __cplusplus
}
#endif


/*----------------------------------------------------------------------------
 *        Arduino objects - C++ only
 *----------------------------------------------------------------------------*/

#ifdef __cplusplus

/*	=========================
 *	===== SERCOM DEFINITION
 *	=========================
*/
extern SERCOM sercom0;
extern SERCOM sercom1;
extern SERCOM sercom2;
extern SERCOM sercom3;
extern SERCOM sercom4;
extern SERCOM sercom5;

extern Uart Serial1;

#endif

// These serial port names are intended to allow libraries and architecture-neutral
// sketches to automatically default to the correct port name for a particular type
// of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
// the first hardware serial port whose RX/TX pins are not dedicated to another use.
//
// SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
//
// SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
//
// SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
//
// SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
//
// SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
//                            pins are NOT connected to anything by default.
#define SERIAL_PORT_USBVIRTUAL      Serial
#define SERIAL_PORT_MONITOR         Serial
// Serial has no physical pins broken out, so it's not listed as HARDWARE port
#define SERIAL_PORT_HARDWARE        Serial1
#define SERIAL_PORT_HARDWARE_OPEN   Serial1




#endif /* _VARIANT_COOMPOSER_PRO_ */
